spec/cassettes/StripeWrapper/StripeWrapper_Charge/_create/with_invalid_credit_card/sets_the_error_message.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4000000000000002&card[exp_month]=8&card[exp_year]=2018&card[cvc]=314
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.15.0
      Authorization:
      - Bearer sk_test_xdqc7MXvyfosWtt0jk2SguRu
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.15.0","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-darwin13.1.0","publisher":"stripe","uname":"Darwin
        Reed-Nelson-Saunderss-MacBook-Pro.local 13.3.0 Darwin Kernel Version 13.3.0:
        Tue Jun  3 21:27:35 PDT 2014; root:xnu-2422.110.17~1/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '81'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 26 Aug 2014 19:37:56 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '596'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-08-20'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_14VplQL7kTE3NNu4oo9bXvIh",
          "livemode": false,
          "created": 1409081876,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_14VplQL7kTE3NNu4Qw6dotAy",
            "object": "card",
            "last4": "0002",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 8,
            "exp_year": 2018,
            "fingerprint": "EJa6GjeOIf0Hx79z",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "customer": null
          }
        }
    http_version: 
  recorded_at: Tue, 26 Aug 2014 19:37:57 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=999&currency=usd&card=tok_14VplQL7kTE3NNu4oo9bXvIh&description=An%20invalid%20charge
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.15.0
      Authorization:
      - Bearer sk_test_xdqc7MXvyfosWtt0jk2SguRu
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.15.0","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-darwin13.1.0","publisher":"stripe","uname":"Darwin
        Reed-Nelson-Saunderss-MacBook-Pro.local 13.3.0 Darwin Kernel Version 13.3.0:
        Tue Jun  3 21:27:35 PDT 2014; root:xnu-2422.110.17~1/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '91'
  response:
    status:
      code: 402
      message: Payment Required
    headers:
      Server:
      - nginx
      Date:
      - Tue, 26 Aug 2014 19:37:57 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '162'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-08-20'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "message": "Your card was declined.",
            "type": "card_error",
            "code": "card_declined",
            "charge": "ch_14VplQL7kTE3NNu4Qh56UaMr"
          }
        }
    http_version: 
  recorded_at: Tue, 26 Aug 2014 19:37:58 GMT
recorded_with: VCR 2.9.2
